alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC4100_series/Include/XMC4100.h
/* ------------------------------  SCU_TRAP_TRAPCLR  ------------------------------ */
#define SCU_TRAP_TRAPCLR_SOSCWDGT_Pos         (0UL)                     /*!< SCU_TRAP TRAPCLR: SOSCWDGT (Bit 0)                          */
#define SCU_TRAP_TRAPCLR_SOSCWDGT_Msk         (0x1UL)                   /*!< SCU_TRAP TRAPCLR: SOSCWDGT (Bitfield-Mask: 0x01)            */
#define SCU_TRAP_TRAPCLR_SVCOLCKT_Pos         (2UL)                     /*!< SCU_TRAP TRAPCLR: SVCOLCKT (Bit 2)                          */
#define SCU_TRAP_TRAPCLR_SVCOLCKT_Msk         (0x4UL)                   /*!< SCU_TRAP TRAPCLR: SVCOLCKT (Bitfield-Mask: 0x01)            */
#define SCU_TRAP_TRAPCLR_UVCOLCKT_Pos         (3UL)                     /*!< SCU_TRAP TRAPCLR: UVCOLCKT (Bit 3)                          */
#define SCU_TRAP_TRAPCLR_UVCOLCKT_Msk         (0x8UL)                   /*!< SCU_TRAP TRAPCLR: UVCOLCKT (Bitfield-Mask: 0x01)            */
#define SCU_TRAP_TRAPCLR_PET_Pos              (4UL)                     /*!< SCU_TRAP TRAPCLR: PET (Bit 4)                               */
#define SCU_TRAP_TRAPCLR_PET_Msk              (0x10UL)                  /*!< SCU_TRAP TRAPCLR: PET (Bitfield-Mask: 0x01)                 */
#define SCU_TRAP_TRAPCLR_BRWNT_Pos            (5UL)                     /*!< SCU_TRAP TRAPCLR: BRWNT (Bit 5)                             */
#define SCU_TRAP_TRAPCLR_BRWNT_Msk            (0x20UL)                  /*!< SCU_TRAP TRAPCLR: BRWNT (Bitfield-Mask: 0x01)               */
#define SCU_TRAP_TRAPCLR_ULPWDGT_Pos          (6UL)                     /*!< SCU_TRAP TRAPCLR: ULPWDGT (Bit 6)                           */
#define SCU_TRAP_TRAPCLR_ULPWDGT_Msk          (0x40UL)                  /*!< SCU_TRAP TRAPCLR: ULPWDGT (Bitfield-Mask: 0x01)             */
#define SCU_TRAP_TRAPCLR_BWERR0T_Pos          (7UL)                     /*!< SCU_TRAP TRAPCLR: BWERR0T (Bit 7)                           */
#define SCU_TRAP_TRAPCLR_BWERR0T_Msk          (0x80UL)                  /*!< SCU_TRAP TRAPCLR: BWERR0T (Bitfield-Mask: 0x01)             */
#define SCU_TRAP_TRAPCLR_BWERR1T_Pos          (8UL)                     /*!< SCU_TRAP TRAPCLR: BWERR1T (Bit 8)                           */
#define SCU_TRAP_TRAPCLR_BWERR1T_Msk          (0x100UL)                 /*!< SCU_TRAP TRAPCLR: BWERR1T (Bitfield-Mask: 0x01)             */
#define SCU_TRAP_TRAPCLR_TEMPHIT_Pos          (12UL)                    /*!< SCU_TRAP TRAPCLR: TEMPHIT (Bit 12)                          */
#define SCU_TRAP_TRAPCLR_TEMPHIT_Msk          (0x1000UL)                /*!< SCU_TRAP TRAPCLR: TEMPHIT (Bitfield-Mask: 0x01)             */
#define SCU_TRAP_TRAPCLR_TEMPLOT_Pos          (13UL)                    /*!< SCU_TRAP TRAPCLR: TEMPLOT (Bit 13)                          */
#define SCU_TRAP_TRAPCLR_TEMPLOT_Msk          (0x2000UL)                /*!< SCU_TRAP TRAPCLR: TEMPLOT (Bitfield-Mask: 0x01)             */

/* ------------------------------  SCU_TRAP_TRAPSET  ------------------------------ */
#define SCU_TRAP_TRAPSET_SOSCWDGT_Pos         (0UL)                     /*!< SCU_TRAP TRAPSET: SOSCWDGT (Bit 0)                          */
#define SCU_TRAP_TRAPSET_SOSCWDGT_Msk         (0x1UL)                   /*!< SCU_TRAP TRAPSET: SOSCWDGT (Bitfield-Mask: 0x01)            */
#define SCU_TRAP_TRAPSET_SVCOLCKT_Pos         (2UL)                     /*!< SCU_TRAP TRAPSET: SVCOLCKT (Bit 2)                          */
#define SCU_TRAP_TRAPSET_SVCOLCKT_Msk         (0x4UL)                   /*!< SCU_TRAP TRAPSET: SVCOLCKT (Bitfield-Mask: 0x01)            */
#define SCU_TRAP_TRAPSET_UVCOLCKT_Pos         (3UL)                     /*!< SCU_TRAP TRAPSET: UVCOLCKT (Bit 3)                          */
#define SCU_TRAP_TRAPSET_UVCOLCKT_Msk         (0x8UL)                   /*!< SCU_TRAP TRAPSET: UVCOLCKT (Bitfield-Mask: 0x01)            */
#define SCU_TRAP_TRAPSET_PET_Pos              (4UL)                     /*!< SCU_TRAP TRAPSET: PET (Bit 4)                               */
#define SCU_TRAP_TRAPSET_PET_Msk              (0x10UL)                  /*!< SCU_TRAP TRAPSET: PET (Bitfield-Mask: 0x01)                 */
#define SCU_TRAP_TRAPSET_BRWNT_Pos            (5UL)                     /*!< SCU_TRAP TRAPSET: BRWNT (Bit 5)                             */
#define SCU_TRAP_TRAPSET_BRWNT_Msk            (0x20UL)                  /*!< SCU_TRAP TRAPSET: BRWNT (Bitfield-Mask: 0x01)               */
#define SCU_TRAP_TRAPSET_ULPWDT_Pos           (6UL)                     /*!< SCU_TRAP TRAPSET: ULPWDT (Bit 6)                            */
#define SCU_TRAP_TRAPSET_ULPWDT_Msk           (0x40UL)                  /*!< SCU_TRAP TRAPSET: ULPWDT (Bitfield-Mask: 0x01)              */
#define SCU_TRAP_TRAPSET_BWERR0T_Pos          (7UL)                     /*!< SCU_TRAP TRAPSET: BWERR0T (Bit 7)                           */
#define SCU_TRAP_TRAPSET_BWERR0T_Msk          (0x80UL)                  /*!< SCU_TRAP TRAPSET: BWERR0T (Bitfield-Mask: 0x01)             */
#define SCU_TRAP_TRAPSET_BWERR1T_Pos          (8UL)                     /*!< SCU_TRAP TRAPSET: BWERR1T (Bit 8)                           */
#define SCU_TRAP_TRAPSET_BWERR1T_Msk          (0x100UL)                 /*!< SCU_TRAP TRAPSET: BWERR1T (Bitfield-Mask: 0x01)             */
#define SCU_TRAP_TRAPSET_TEMPHIT_Pos          (12UL)                    /*!< SCU_TRAP TRAPSET: TEMPHIT (Bit 12)                          */
#define SCU_TRAP_TRAPSET_TEMPHIT_Msk          (0x1000UL)                /*!< SCU_TRAP TRAPSET: TEMPHIT (Bitfield-Mask: 0x01)             */
#define SCU_TRAP_TRAPSET_TEMPLOT_Pos          (13UL)                    /*!< SCU_TRAP TRAPSET: TEMPLOT (Bit 13)                          */
#define SCU_TRAP_TRAPSET_TEMPLOT_Msk          (0x2000UL)                /*!< SCU_TRAP TRAPSET: TEMPLOT (Bitfield-Mask: 0x01)             */


/* ================================================================================ */
/* ================     struct 'SCU_HIBERNATE' Position & Mask     ================ */
/* ================================================================================ */


/* ----------------------------  SCU_HIBERNATE_HDSTAT  ---------------------------- */
#define SCU_HIBERNATE_HDSTAT_EPEV_Pos         (0UL)                     /*!< SCU_HIBERNATE HDSTAT: EPEV (Bit 0)                          */
#define SCU_HIBERNATE_HDSTAT_EPEV_Msk         (0x1UL)                   /*!< SCU_HIBERNATE HDSTAT: EPEV (Bitfield-Mask: 0x01)            */
#define SCU_HIBERNATE_HDSTAT_ENEV_Pos         (1UL)                     /*!< SCU_HIBERNATE HDSTAT: ENEV (Bit 1)                          */
#define SCU_HIBERNATE_HDSTAT_ENEV_Msk         (0x2UL)                   /*!< SCU_HIBERNATE HDSTAT: ENEV (Bitfield-Mask: 0x01)            */
#define SCU_HIBERNATE_HDSTAT_RTCEV_Pos        (2UL)                     /*!< SCU_HIBERNATE HDSTAT: RTCEV (Bit 2)                         */
#define SCU_HIBERNATE_HDSTAT_RTCEV_Msk        (0x4UL)                   /*!< SCU_HIBERNATE HDSTAT: RTCEV (Bitfield-Mask: 0x01)           */
#define SCU_HIBERNATE_HDSTAT_ULPWDG_Pos       (3UL)                     /*!< SCU_HIBERNATE HDSTAT: ULPWDG (Bit 3)                        */
#define SCU_HIBERNATE_HDSTAT_ULPWDG_Msk       (0x8UL)                   /*!< SCU_HIBERNATE HDSTAT: ULPWDG (Bitfield-Mask: 0x01)          */
#define SCU_HIBERNATE_HDSTAT_HIBNOUT_Pos      (4UL)                     /*!< SCU_HIBERNATE HDSTAT: HIBNOUT (Bit 4)                       */
#define SCU_HIBERNATE_HDSTAT_HIBNOUT_Msk      (0x10UL)                  /*!< SCU_HIBERNATE HDSTAT: HIBNOUT (Bitfield-Mask: 0x01)         */
#define SCU_HIBERNATE_HDSTAT_VBATPEV_Pos      (8UL)                     /*!< SCU_HIBERNATE HDSTAT: VBATPEV (Bit 8)                       */
#define SCU_HIBERNATE_HDSTAT_VBATPEV_Msk      (0x100UL)                 /*!< SCU_HIBERNATE HDSTAT: VBATPEV (Bitfield-Mask: 0x01)         */
#define SCU_HIBERNATE_HDSTAT_VBATNEV_Pos      (9UL)                     /*!< SCU_HIBERNATE HDSTAT: VBATNEV (Bit 9)                       */
#define SCU_HIBERNATE_HDSTAT_VBATNEV_Msk      (0x200UL)                 /*!< SCU_HIBERNATE HDSTAT: VBATNEV (Bitfield-Mask: 0x01)         */
#define SCU_HIBERNATE_HDSTAT_AHIBIO0PEV_Pos   (10UL)                    /*!< SCU_HIBERNATE HDSTAT: AHIBIO0PEV (Bit 10)                   */
#define SCU_HIBERNATE_HDSTAT_AHIBIO0PEV_Msk   (0x400UL)                 /*!< SCU_HIBERNATE HDSTAT: AHIBIO0PEV (Bitfield-Mask: 0x01)      */
#define SCU_HIBERNATE_HDSTAT_AHIBIO0NEV_Pos   (11UL)                    /*!< SCU_HIBERNATE HDSTAT: AHIBIO0NEV (Bit 11)                   */
#define SCU_HIBERNATE_HDSTAT_AHIBIO0NEV_Msk   (0x800UL)                 /*!< SCU_HIBERNATE HDSTAT: AHIBIO0NEV (Bitfield-Mask: 0x01)      */

/* -----------------------------  SCU_HIBERNATE_HDCLR  ---------------------------- */
#define SCU_HIBERNATE_HDCLR_EPEV_Pos          (0UL)                     /*!< SCU_HIBERNATE HDCLR: EPEV (Bit 0)                           */
#define SCU_HIBERNATE_HDCLR_EPEV_Msk          (0x1UL)                   /*!< SCU_HIBERNATE HDCLR: EPEV (Bitfield-Mask: 0x01)             */
#define SCU_HIBERNATE_HDCLR_ENEV_Pos          (1UL)                     /*!< SCU_HIBERNATE HDCLR: ENEV (Bit 1)                           */
#define SCU_HIBERNATE_HDCLR_ENEV_Msk          (0x2UL)                   /*!< SCU_HIBERNATE HDCLR: ENEV (Bitfield-Mask: 0x01)             */
#define SCU_HIBERNATE_HDCLR_RTCEV_Pos         (2UL)                     /*!< SCU_HIBERNATE HDCLR: RTCEV (Bit 2)                          */
#define SCU_HIBERNATE_HDCLR_RTCEV_Msk         (0x4UL)                   /*!< SCU_HIBERNATE HDCLR: RTCEV (Bitfield-Mask: 0x01)            */
#define SCU_HIBERNATE_HDCLR_ULPWDG_Pos        (3UL)                     /*!< SCU_HIBERNATE HDCLR: ULPWDG (Bit 3)                         */
#define SCU_HIBERNATE_HDCLR_ULPWDG_Msk        (0x8UL)                   /*!< SCU_HIBERNATE HDCLR: ULPWDG (Bitfield-Mask: 0x01)           */
#define SCU_HIBERNATE_HDCLR_VBATPEV_Pos       (8UL)                     /*!< SCU_HIBERNATE HDCLR: VBATPEV (Bit 8)                        */
#define SCU_HIBERNATE_HDCLR_VBATPEV_Msk       (0x100UL)                 /*!< SCU_HIBERNATE HDCLR: VBATPEV (Bitfield-Mask: 0x01)          */
#define SCU_HIBERNATE_HDCLR_VBATNEV_Pos       (9UL)                     /*!< SCU_HIBERNATE HDCLR: VBATNEV (Bit 9)                        */
#define SCU_HIBERNATE_HDCLR_VBATNEV_Msk       (0x200UL)                 /*!< SCU_HIBERNATE HDCLR: VBATNEV (Bitfield-Mask: 0x01)          */
#define SCU_HIBERNATE_HDCLR_AHIBIO0PEV_Pos    (10UL)                    /*!< SCU_HIBERNATE HDCLR: AHIBIO0PEV (Bit 10)                    */
#define SCU_HIBERNATE_HDCLR_AHIBIO0PEV_Msk    (0x400UL)                 /*!< SCU_HIBERNATE HDCLR: AHIBIO0PEV (Bitfield-Mask: 0x01)       */
#define SCU_HIBERNATE_HDCLR_AHIBIO0NEV_Pos    (11UL)                    /*!< SCU_HIBERNATE HDCLR: AHIBIO0NEV (Bit 11)                    */
#define SCU_HIBERNATE_HDCLR_AHIBIO0NEV_Msk    (0x800UL)                 /*!< SCU_HIBERNATE HDCLR: AHIBIO0NEV (Bitfield-Mask: 0x01)       */

/* -----------------------------  SCU_HIBERNATE_HDSET  ---------------------------- */
#define SCU_HIBERNATE_HDSET_EPEV_Pos          (0UL)                     /*!< SCU_HIBERNATE HDSET: EPEV (Bit 0)                           */
#define SCU_HIBERNATE_HDSET_EPEV_Msk          (0x1UL)                   /*!< SCU_HIBERNATE HDSET: EPEV (Bitfield-Mask: 0x01)             */
#define SCU_HIBERNATE_HDSET_ENEV_Pos          (1UL)                     /*!< SCU_HIBERNATE HDSET: ENEV (Bit 1)                           */
#define SCU_HIBERNATE_HDSET_ENEV_Msk          (0x2UL)                   /*!< SCU_HIBERNATE HDSET: ENEV (Bitfield-Mask: 0x01)             */
#define SCU_HIBERNATE_HDSET_RTCEV_Pos         (2UL)                     /*!< SCU_HIBERNATE HDSET: RTCEV (Bit 2)                          */
#define SCU_HIBERNATE_HDSET_RTCEV_Msk         (0x4UL)                   /*!< SCU_HIBERNATE HDSET: RTCEV (Bitfield-Mask: 0x01)            */
#define SCU_HIBERNATE_HDSET_ULPWDG_Pos        (3UL)                     /*!< SCU_HIBERNATE HDSET: ULPWDG (Bit 3)                         */
#define SCU_HIBERNATE_HDSET_ULPWDG_Msk        (0x8UL)                   /*!< SCU_HIBERNATE HDSET: ULPWDG (Bitfield-Mask: 0x01)           */
#define SCU_HIBERNATE_HDSET_VBATPEV_Pos       (8UL)                     /*!< SCU_HIBERNATE HDSET: VBATPEV (Bit 8)                        */
#define SCU_HIBERNATE_HDSET_VBATPEV_Msk       (0x100UL)                 /*!< SCU_HIBERNATE HDSET: VBATPEV (Bitfield-Mask: 0x01)          */
#define SCU_HIBERNATE_HDSET_VBATNEV_Pos       (9UL)                     /*!< SCU_HIBERNATE HDSET: VBATNEV (Bit 9)                        */
#define SCU_HIBERNATE_HDSET_VBATNEV_Msk       (0x200UL)                 /*!< SCU_HIBERNATE HDSET: VBATNEV (Bitfield-Mask: 0x01)          */
#define SCU_HIBERNATE_HDSET_AHIBIO0PEV_Pos    (10UL)                    /*!< SCU_HIBERNATE HDSET: AHIBIO0PEV (Bit 10)                    */
#define SCU_HIBERNATE_HDSET_AHIBIO0PEV_Msk    (0x400UL)                 /*!< SCU_HIBERNATE HDSET: AHIBIO0PEV (Bitfield-Mask: 0x01)       */
#define SCU_HIBERNATE_HDSET_AHIBIO0NEV_Pos    (11UL)                    /*!< SCU_HIBERNATE HDSET: AHIBIO0NEV (Bit 11)                    */
#define SCU_HIBERNATE_HDSET_AHIBIO0NEV_Msk    (0x800UL)                 /*!< SCU_HIBERNATE HDSET: AHIBIO0NEV (Bitfield-Mask: 0x01)       */

/* -----------------------------  SCU_HIBERNATE_HDCR  ----------------------------- */
#define SCU_HIBERNATE_HDCR_WKPEP_Pos          (0UL)                     /*!< SCU_HIBERNATE HDCR: WKPEP (Bit 0)                           */
#define SCU_HIBERNATE_HDCR_WKPEP_Msk          (0x1UL)                   /*!< SCU_HIBERNATE HDCR: WKPEP (Bitfield-Mask: 0x01)             */
#define SCU_HIBERNATE_HDCR_WKPEN_Pos          (1UL)                     /*!< SCU_HIBERNATE HDCR: WKPEN (Bit 1)                           */
#define SCU_HIBERNATE_HDCR_WKPEN_Msk          (0x2UL)                   /*!< SCU_HIBERNATE HDCR: WKPEN (Bitfield-Mask: 0x01)             */
#define SCU_HIBERNATE_HDCR_RTCE_Pos           (2UL)                     /*!< SCU_HIBERNATE HDCR: RTCE (Bit 2)                            */
#define SCU_HIBERNATE_HDCR_RTCE_Msk           (0x4UL)                   /*!< SCU_HIBERNATE HDCR: RTCE (Bitfield-Mask: 0x01)              */
#define SCU_HIBERNATE_HDCR_ULPWDGEN_Pos       (3UL)                     /*!< SCU_HIBERNATE HDCR: ULPWDGEN (Bit 3)                        */
#define SCU_HIBERNATE_HDCR_ULPWDGEN_Msk       (0x8UL)                   /*!< SCU_HIBERNATE HDCR: ULPWDGEN (Bitfield-Mask: 0x01)          */
#define SCU_HIBERNATE_HDCR_HIB_Pos            (4UL)                     /*!< SCU_HIBERNATE HDCR: HIB (Bit 4)                             */
#define SCU_HIBERNATE_HDCR_HIB_Msk            (0x10UL)                  /*!< SCU_HIBERNATE HDCR: HIB (Bitfield-Mask: 0x01)               */
#define SCU_HIBERNATE_HDCR_XTALGPI1SEL_Pos    (5UL)                     /*!< SCU_HIBERNATE HDCR: XTALGPI1SEL (Bit 5)                     */
#define SCU_HIBERNATE_HDCR_XTALGPI1SEL_Msk    (0x20UL)                  /*!< SCU_HIBERNATE HDCR: XTALGPI1SEL (Bitfield-Mask: 0x01)       */
#define SCU_HIBERNATE_HDCR_RCS_Pos            (6UL)                     /*!< SCU_HIBERNATE HDCR: RCS (Bit 6)                             */
#define SCU_HIBERNATE_HDCR_RCS_Msk            (0x40UL)                  /*!< SCU_HIBERNATE HDCR: RCS (Bitfield-Mask: 0x01)               */
#define SCU_HIBERNATE_HDCR_STDBYSEL_Pos       (7UL)                     /*!< SCU_HIBERNATE HDCR: STDBYSEL (Bit 7)                        */
#define SCU_HIBERNATE_HDCR_STDBYSEL_Msk       (0x80UL)                  /*!< SCU_HIBERNATE HDCR: STDBYSEL (Bitfield-Mask: 0x01)          */
#define SCU_HIBERNATE_HDCR_WKUPSEL_Pos        (8UL)                     /*!< SCU_HIBERNATE HDCR: WKUPSEL (Bit 8)                         */
#define SCU_HIBERNATE_HDCR_WKUPSEL_Msk        (0x100UL)                 /*!< SCU_HIBERNATE HDCR: WKUPSEL (Bitfield-Mask: 0x01)           */
#define SCU_HIBERNATE_HDCR_GPI0SEL_Pos        (10UL)                    /*!< SCU_HIBERNATE HDCR: GPI0SEL (Bit 10)                        */
#define SCU_HIBERNATE_HDCR_GPI0SEL_Msk        (0x400UL)                 /*!< SCU_HIBERNATE HDCR: GPI0SEL (Bitfield-Mask: 0x01)           */
#define SCU_HIBERNATE_HDCR_HIBIO0POL_Pos      (12UL)                    /*!< SCU_HIBERNATE HDCR: HIBIO0POL (Bit 12)                      */
#define SCU_HIBERNATE_HDCR_HIBIO0POL_Msk      (0x1000UL)                /*!< SCU_HIBERNATE HDCR: HIBIO0POL (Bitfield-Mask: 0x01)         */
#define SCU_HIBERNATE_HDCR_ADIG0SEL_Pos       (14UL)                    /*!< SCU_HIBERNATE HDCR: ADIG0SEL (Bit 14)                       */
#define SCU_HIBERNATE_HDCR_ADIG0SEL_Msk       (0x4000UL)                /*!< SCU_HIBERNATE HDCR: ADIG0SEL (Bitfield-Mask: 0x01)          */
#define SCU_HIBERNATE_HDCR_HIBIO0SEL_Pos      (16UL)                    /*!< SCU_HIBERNATE HDCR: HIBIO0SEL (Bit 16)                      */
#define SCU_HIBERNATE_HDCR_HIBIO0SEL_Msk      (0xf0000UL)               /*!< SCU_HIBERNATE HDCR: HIBIO0SEL (Bitfield-Mask: 0x0f)         */
#define SCU_HIBERNATE_HDCR_VBATLO_Pos         (24UL)                    /*!< SCU_HIBERNATE HDCR: VBATLO (Bit 24)                         */
#define SCU_HIBERNATE_HDCR_VBATLO_Msk         (0x1000000UL)             /*!< SCU_HIBERNATE HDCR: VBATLO (Bitfield-Mask: 0x01)            */
#define SCU_HIBERNATE_HDCR_VBATHI_Pos         (25UL)                    /*!< SCU_HIBERNATE HDCR: VBATHI (Bit 25)                         */
#define SCU_HIBERNATE_HDCR_VBATHI_Msk         (0x2000000UL)             /*!< SCU_HIBERNATE HDCR: VBATHI (Bitfield-Mask: 0x01)            */
#define SCU_HIBERNATE_HDCR_AHIBIO0LO_Pos      (26UL)                    /*!< SCU_HIBERNATE HDCR: AHIBIO0LO (Bit 26)                      */
#define SCU_HIBERNATE_HDCR_AHIBIO0LO_Msk      (0x4000000UL)             /*!< SCU_HIBERNATE HDCR: AHIBIO0LO (Bitfield-Mask: 0x01)         */
#define SCU_HIBERNATE_HDCR_AHIBIO0HI_Pos      (27UL)                    /*!< SCU_HIBERNATE HDCR: AHIBIO0HI (Bit 27)                      */
#define SCU_HIBERNATE_HDCR_AHIBIO0HI_Msk      (0x8000000UL)             /*!< SCU_HIBERNATE HDCR: AHIBIO0HI (Bitfield-Mask: 0x01)         */

/* ---------------------------  SCU_HIBERNATE_OSCSICTRL  -------------------------- */
#define SCU_HIBERNATE_OSCSICTRL_PWD_Pos       (0UL)                     /*!< SCU_HIBERNATE OSCSICTRL: PWD (Bit 0)                        */
#define SCU_HIBERNATE_OSCSICTRL_PWD_Msk       (0x1UL)                   /*!< SCU_HIBERNATE OSCSICTRL: PWD (Bitfield-Mask: 0x01)          */

