alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC4100_series/Include/XMC4100.h
/* ---------------------------------  USB_GINTMSK  -------------------------------- */
#define USB_GINTMSK_SofMsk_Pos                (3UL)                     /*!< USB GINTMSK: SofMsk (Bit 3)                                 */
#define USB_GINTMSK_SofMsk_Msk                (0x8UL)                   /*!< USB GINTMSK: SofMsk (Bitfield-Mask: 0x01)                   */
#define USB_GINTMSK_RxFLvlMsk_Pos             (4UL)                     /*!< USB GINTMSK: RxFLvlMsk (Bit 4)                              */
#define USB_GINTMSK_RxFLvlMsk_Msk             (0x10UL)                  /*!< USB GINTMSK: RxFLvlMsk (Bitfield-Mask: 0x01)                */
#define USB_GINTMSK_GINNakEffMsk_Pos          (6UL)                     /*!< USB GINTMSK: GINNakEffMsk (Bit 6)                           */
#define USB_GINTMSK_GINNakEffMsk_Msk          (0x40UL)                  /*!< USB GINTMSK: GINNakEffMsk (Bitfield-Mask: 0x01)             */
#define USB_GINTMSK_GOUTNakEffMsk_Pos         (7UL)                     /*!< USB GINTMSK: GOUTNakEffMsk (Bit 7)                          */
#define USB_GINTMSK_GOUTNakEffMsk_Msk         (0x80UL)                  /*!< USB GINTMSK: GOUTNakEffMsk (Bitfield-Mask: 0x01)            */
#define USB_GINTMSK_ErlySuspMsk_Pos           (10UL)                    /*!< USB GINTMSK: ErlySuspMsk (Bit 10)                           */
#define USB_GINTMSK_ErlySuspMsk_Msk           (0x400UL)                 /*!< USB GINTMSK: ErlySuspMsk (Bitfield-Mask: 0x01)              */
#define USB_GINTMSK_USBSuspMsk_Pos            (11UL)                    /*!< USB GINTMSK: USBSuspMsk (Bit 11)                            */
#define USB_GINTMSK_USBSuspMsk_Msk            (0x800UL)                 /*!< USB GINTMSK: USBSuspMsk (Bitfield-Mask: 0x01)               */
#define USB_GINTMSK_USBRstMsk_Pos             (12UL)                    /*!< USB GINTMSK: USBRstMsk (Bit 12)                             */
#define USB_GINTMSK_USBRstMsk_Msk             (0x1000UL)                /*!< USB GINTMSK: USBRstMsk (Bitfield-Mask: 0x01)                */
#define USB_GINTMSK_EnumDoneMsk_Pos           (13UL)                    /*!< USB GINTMSK: EnumDoneMsk (Bit 13)                           */
#define USB_GINTMSK_EnumDoneMsk_Msk           (0x2000UL)                /*!< USB GINTMSK: EnumDoneMsk (Bitfield-Mask: 0x01)              */
#define USB_GINTMSK_ISOOutDropMsk_Pos         (14UL)                    /*!< USB GINTMSK: ISOOutDropMsk (Bit 14)                         */
#define USB_GINTMSK_ISOOutDropMsk_Msk         (0x4000UL)                /*!< USB GINTMSK: ISOOutDropMsk (Bitfield-Mask: 0x01)            */
#define USB_GINTMSK_EOPFMsk_Pos               (15UL)                    /*!< USB GINTMSK: EOPFMsk (Bit 15)                               */
#define USB_GINTMSK_EOPFMsk_Msk               (0x8000UL)                /*!< USB GINTMSK: EOPFMsk (Bitfield-Mask: 0x01)                  */
#define USB_GINTMSK_IEPIntMsk_Pos             (18UL)                    /*!< USB GINTMSK: IEPIntMsk (Bit 18)                             */
#define USB_GINTMSK_IEPIntMsk_Msk             (0x40000UL)               /*!< USB GINTMSK: IEPIntMsk (Bitfield-Mask: 0x01)                */
#define USB_GINTMSK_OEPIntMsk_Pos             (19UL)                    /*!< USB GINTMSK: OEPIntMsk (Bit 19)                             */
#define USB_GINTMSK_OEPIntMsk_Msk             (0x80000UL)               /*!< USB GINTMSK: OEPIntMsk (Bitfield-Mask: 0x01)                */
#define USB_GINTMSK_incompISOINMsk_Pos        (20UL)                    /*!< USB GINTMSK: incompISOINMsk (Bit 20)                        */
#define USB_GINTMSK_incompISOINMsk_Msk        (0x100000UL)              /*!< USB GINTMSK: incompISOINMsk (Bitfield-Mask: 0x01)           */
#define USB_GINTMSK_incomplSOOUTMsk_Pos       (21UL)                    /*!< USB GINTMSK: incomplSOOUTMsk (Bit 21)                       */
#define USB_GINTMSK_incomplSOOUTMsk_Msk       (0x200000UL)              /*!< USB GINTMSK: incomplSOOUTMsk (Bitfield-Mask: 0x01)          */
#define USB_GINTMSK_WkUpIntMsk_Pos            (31UL)                    /*!< USB GINTMSK: WkUpIntMsk (Bit 31)                            */
#define USB_GINTMSK_WkUpIntMsk_Msk            (0x80000000UL)            /*!< USB GINTMSK: WkUpIntMsk (Bitfield-Mask: 0x01)               */

/* ---------------------------------  USB_GRXSTSR  -------------------------------- */
#define USB_GRXSTSR_EPNum_Pos                 (0UL)                     /*!< USB GRXSTSR: EPNum (Bit 0)                                  */
#define USB_GRXSTSR_EPNum_Msk                 (0xfUL)                   /*!< USB GRXSTSR: EPNum (Bitfield-Mask: 0x0f)                    */
#define USB_GRXSTSR_BCnt_Pos                  (4UL)                     /*!< USB GRXSTSR: BCnt (Bit 4)                                   */
#define USB_GRXSTSR_BCnt_Msk                  (0x7ff0UL)                /*!< USB GRXSTSR: BCnt (Bitfield-Mask: 0x7ff)                    */
#define USB_GRXSTSR_DPID_Pos                  (15UL)                    /*!< USB GRXSTSR: DPID (Bit 15)                                  */
#define USB_GRXSTSR_DPID_Msk                  (0x18000UL)               /*!< USB GRXSTSR: DPID (Bitfield-Mask: 0x03)                     */
#define USB_GRXSTSR_PktSts_Pos                (17UL)                    /*!< USB GRXSTSR: PktSts (Bit 17)                                */
#define USB_GRXSTSR_PktSts_Msk                (0x1e0000UL)              /*!< USB GRXSTSR: PktSts (Bitfield-Mask: 0x0f)                   */
#define USB_GRXSTSR_FN_Pos                    (21UL)                    /*!< USB GRXSTSR: FN (Bit 21)                                    */
#define USB_GRXSTSR_FN_Msk                    (0x1e00000UL)             /*!< USB GRXSTSR: FN (Bitfield-Mask: 0x0f)                       */

/* ---------------------------------  USB_GRXSTSP  -------------------------------- */
#define USB_GRXSTSP_EPNum_Pos                 (0UL)                     /*!< USB GRXSTSP: EPNum (Bit 0)                                  */
#define USB_GRXSTSP_EPNum_Msk                 (0xfUL)                   /*!< USB GRXSTSP: EPNum (Bitfield-Mask: 0x0f)                    */
#define USB_GRXSTSP_BCnt_Pos                  (4UL)                     /*!< USB GRXSTSP: BCnt (Bit 4)                                   */
#define USB_GRXSTSP_BCnt_Msk                  (0x7ff0UL)                /*!< USB GRXSTSP: BCnt (Bitfield-Mask: 0x7ff)                    */
#define USB_GRXSTSP_DPID_Pos                  (15UL)                    /*!< USB GRXSTSP: DPID (Bit 15)                                  */
#define USB_GRXSTSP_DPID_Msk                  (0x18000UL)               /*!< USB GRXSTSP: DPID (Bitfield-Mask: 0x03)                     */
#define USB_GRXSTSP_PktSts_Pos                (17UL)                    /*!< USB GRXSTSP: PktSts (Bit 17)                                */
#define USB_GRXSTSP_PktSts_Msk                (0x1e0000UL)              /*!< USB GRXSTSP: PktSts (Bitfield-Mask: 0x0f)                   */
#define USB_GRXSTSP_FN_Pos                    (21UL)                    /*!< USB GRXSTSP: FN (Bit 21)                                    */
#define USB_GRXSTSP_FN_Msk                    (0x1e00000UL)             /*!< USB GRXSTSP: FN (Bitfield-Mask: 0x0f)                       */

