alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC4100_series/Include/XMC4100.h
/* --------------------------------  HRPWM0_CSG_SC  ------------------------------- */
#define HRPWM0_CSG_SC_PSRM_Pos                (0UL)                     /*!< HRPWM0_CSG SC: PSRM (Bit 0)                                 */
#define HRPWM0_CSG_SC_PSRM_Msk                (0x3UL)                   /*!< HRPWM0_CSG SC: PSRM (Bitfield-Mask: 0x03)                   */
#define HRPWM0_CSG_SC_PSTM_Pos                (2UL)                     /*!< HRPWM0_CSG SC: PSTM (Bit 2)                                 */
#define HRPWM0_CSG_SC_PSTM_Msk                (0xcUL)                   /*!< HRPWM0_CSG SC: PSTM (Bitfield-Mask: 0x03)                   */
#define HRPWM0_CSG_SC_FPD_Pos                 (4UL)                     /*!< HRPWM0_CSG SC: FPD (Bit 4)                                  */
#define HRPWM0_CSG_SC_FPD_Msk                 (0x10UL)                  /*!< HRPWM0_CSG SC: FPD (Bitfield-Mask: 0x01)                    */
#define HRPWM0_CSG_SC_PSV_Pos                 (5UL)                     /*!< HRPWM0_CSG SC: PSV (Bit 5)                                  */
#define HRPWM0_CSG_SC_PSV_Msk                 (0x60UL)                  /*!< HRPWM0_CSG SC: PSV (Bitfield-Mask: 0x03)                    */
#define HRPWM0_CSG_SC_SCM_Pos                 (8UL)                     /*!< HRPWM0_CSG SC: SCM (Bit 8)                                  */
#define HRPWM0_CSG_SC_SCM_Msk                 (0x300UL)                 /*!< HRPWM0_CSG SC: SCM (Bitfield-Mask: 0x03)                    */
#define HRPWM0_CSG_SC_SSRM_Pos                (10UL)                    /*!< HRPWM0_CSG SC: SSRM (Bit 10)                                */
#define HRPWM0_CSG_SC_SSRM_Msk                (0xc00UL)                 /*!< HRPWM0_CSG SC: SSRM (Bitfield-Mask: 0x03)                   */
#define HRPWM0_CSG_SC_SSTM_Pos                (12UL)                    /*!< HRPWM0_CSG SC: SSTM (Bit 12)                                */
#define HRPWM0_CSG_SC_SSTM_Msk                (0x3000UL)                /*!< HRPWM0_CSG SC: SSTM (Bitfield-Mask: 0x03)                   */
#define HRPWM0_CSG_SC_SVSC_Pos                (14UL)                    /*!< HRPWM0_CSG SC: SVSC (Bit 14)                                */
#define HRPWM0_CSG_SC_SVSC_Msk                (0xc000UL)                /*!< HRPWM0_CSG SC: SVSC (Bitfield-Mask: 0x03)                   */
#define HRPWM0_CSG_SC_SWSM_Pos                (16UL)                    /*!< HRPWM0_CSG SC: SWSM (Bit 16)                                */
#define HRPWM0_CSG_SC_SWSM_Msk                (0x30000UL)               /*!< HRPWM0_CSG SC: SWSM (Bitfield-Mask: 0x03)                   */
#define HRPWM0_CSG_SC_GCFG_Pos                (18UL)                    /*!< HRPWM0_CSG SC: GCFG (Bit 18)                                */
#define HRPWM0_CSG_SC_GCFG_Msk                (0xc0000UL)               /*!< HRPWM0_CSG SC: GCFG (Bitfield-Mask: 0x03)                   */
#define HRPWM0_CSG_SC_IST_Pos                 (20UL)                    /*!< HRPWM0_CSG SC: IST (Bit 20)                                 */
#define HRPWM0_CSG_SC_IST_Msk                 (0x100000UL)              /*!< HRPWM0_CSG SC: IST (Bitfield-Mask: 0x01)                    */
#define HRPWM0_CSG_SC_PSE_Pos                 (21UL)                    /*!< HRPWM0_CSG SC: PSE (Bit 21)                                 */
#define HRPWM0_CSG_SC_PSE_Msk                 (0x200000UL)              /*!< HRPWM0_CSG SC: PSE (Bitfield-Mask: 0x01)                    */
#define HRPWM0_CSG_SC_PSWM_Pos                (24UL)                    /*!< HRPWM0_CSG SC: PSWM (Bit 24)                                */
#define HRPWM0_CSG_SC_PSWM_Msk                (0x3000000UL)             /*!< HRPWM0_CSG SC: PSWM (Bitfield-Mask: 0x03)                   */

/* --------------------------------  HRPWM0_CSG_PC  ------------------------------- */
#define HRPWM0_CSG_PC_PSWV_Pos                (0UL)                     /*!< HRPWM0_CSG PC: PSWV (Bit 0)                                 */
#define HRPWM0_CSG_PC_PSWV_Msk                (0x3fUL)                  /*!< HRPWM0_CSG PC: PSWV (Bitfield-Mask: 0x3f)                   */

/* -------------------------------  HRPWM0_CSG_DSV1  ------------------------------ */
#define HRPWM0_CSG_DSV1_DSV1_Pos              (0UL)                     /*!< HRPWM0_CSG DSV1: DSV1 (Bit 0)                               */
#define HRPWM0_CSG_DSV1_DSV1_Msk              (0x3ffUL)                 /*!< HRPWM0_CSG DSV1: DSV1 (Bitfield-Mask: 0x3ff)                */

/* -------------------------------  HRPWM0_CSG_DSV2  ------------------------------ */
#define HRPWM0_CSG_DSV2_DSV2_Pos              (0UL)                     /*!< HRPWM0_CSG DSV2: DSV2 (Bit 0)                               */
#define HRPWM0_CSG_DSV2_DSV2_Msk              (0x3ffUL)                 /*!< HRPWM0_CSG DSV2: DSV2 (Bitfield-Mask: 0x3ff)                */

/* ------------------------------  HRPWM0_CSG_SDSV1  ------------------------------ */
#define HRPWM0_CSG_SDSV1_SDSV1_Pos            (0UL)                     /*!< HRPWM0_CSG SDSV1: SDSV1 (Bit 0)                             */
#define HRPWM0_CSG_SDSV1_SDSV1_Msk            (0x3ffUL)                 /*!< HRPWM0_CSG SDSV1: SDSV1 (Bitfield-Mask: 0x3ff)              */

/* -------------------------------  HRPWM0_CSG_SPC  ------------------------------- */
#define HRPWM0_CSG_SPC_SPSWV_Pos              (0UL)                     /*!< HRPWM0_CSG SPC: SPSWV (Bit 0)                               */
#define HRPWM0_CSG_SPC_SPSWV_Msk              (0x3fUL)                  /*!< HRPWM0_CSG SPC: SPSWV (Bitfield-Mask: 0x3f)                 */

/* --------------------------------  HRPWM0_CSG_CC  ------------------------------- */
#define HRPWM0_CSG_CC_IBS_Pos                 (0UL)                     /*!< HRPWM0_CSG CC: IBS (Bit 0)                                  */
#define HRPWM0_CSG_CC_IBS_Msk                 (0xfUL)                   /*!< HRPWM0_CSG CC: IBS (Bitfield-Mask: 0x0f)                    */
#define HRPWM0_CSG_CC_IMCS_Pos                (8UL)                     /*!< HRPWM0_CSG CC: IMCS (Bit 8)                                 */
#define HRPWM0_CSG_CC_IMCS_Msk                (0x100UL)                 /*!< HRPWM0_CSG CC: IMCS (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG_CC_IMCC_Pos                (9UL)                     /*!< HRPWM0_CSG CC: IMCC (Bit 9)                                 */
#define HRPWM0_CSG_CC_IMCC_Msk                (0x600UL)                 /*!< HRPWM0_CSG CC: IMCC (Bitfield-Mask: 0x03)                   */
#define HRPWM0_CSG_CC_ESE_Pos                 (11UL)                    /*!< HRPWM0_CSG CC: ESE (Bit 11)                                 */
#define HRPWM0_CSG_CC_ESE_Msk                 (0x800UL)                 /*!< HRPWM0_CSG CC: ESE (Bitfield-Mask: 0x01)                    */
#define HRPWM0_CSG_CC_OIE_Pos                 (12UL)                    /*!< HRPWM0_CSG CC: OIE (Bit 12)                                 */
#define HRPWM0_CSG_CC_OIE_Msk                 (0x1000UL)                /*!< HRPWM0_CSG CC: OIE (Bitfield-Mask: 0x01)                    */
#define HRPWM0_CSG_CC_OSE_Pos                 (13UL)                    /*!< HRPWM0_CSG CC: OSE (Bit 13)                                 */
#define HRPWM0_CSG_CC_OSE_Msk                 (0x2000UL)                /*!< HRPWM0_CSG CC: OSE (Bitfield-Mask: 0x01)                    */
#define HRPWM0_CSG_CC_BLMC_Pos                (14UL)                    /*!< HRPWM0_CSG CC: BLMC (Bit 14)                                */
#define HRPWM0_CSG_CC_BLMC_Msk                (0xc000UL)                /*!< HRPWM0_CSG CC: BLMC (Bitfield-Mask: 0x03)                   */
#define HRPWM0_CSG_CC_EBE_Pos                 (16UL)                    /*!< HRPWM0_CSG CC: EBE (Bit 16)                                 */
#define HRPWM0_CSG_CC_EBE_Msk                 (0x10000UL)               /*!< HRPWM0_CSG CC: EBE (Bitfield-Mask: 0x01)                    */
#define HRPWM0_CSG_CC_COFE_Pos                (17UL)                    /*!< HRPWM0_CSG CC: COFE (Bit 17)                                */
#define HRPWM0_CSG_CC_COFE_Msk                (0x20000UL)               /*!< HRPWM0_CSG CC: COFE (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG_CC_COFM_Pos                (18UL)                    /*!< HRPWM0_CSG CC: COFM (Bit 18)                                */
#define HRPWM0_CSG_CC_COFM_Msk                (0x3c0000UL)              /*!< HRPWM0_CSG CC: COFM (Bitfield-Mask: 0x0f)                   */
#define HRPWM0_CSG_CC_COFC_Pos                (24UL)                    /*!< HRPWM0_CSG CC: COFC (Bit 24)                                */
#define HRPWM0_CSG_CC_COFC_Msk                (0x3000000UL)             /*!< HRPWM0_CSG CC: COFC (Bitfield-Mask: 0x03)                   */

/* -------------------------------  HRPWM0_CSG_PLC  ------------------------------- */
#define HRPWM0_CSG_PLC_IPLS_Pos               (0UL)                     /*!< HRPWM0_CSG PLC: IPLS (Bit 0)                                */
#define HRPWM0_CSG_PLC_IPLS_Msk               (0xfUL)                   /*!< HRPWM0_CSG PLC: IPLS (Bitfield-Mask: 0x0f)                  */
#define HRPWM0_CSG_PLC_PLCL_Pos               (8UL)                     /*!< HRPWM0_CSG PLC: PLCL (Bit 8)                                */
#define HRPWM0_CSG_PLC_PLCL_Msk               (0x300UL)                 /*!< HRPWM0_CSG PLC: PLCL (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG_PLC_PSL_Pos                (10UL)                    /*!< HRPWM0_CSG PLC: PSL (Bit 10)                                */
#define HRPWM0_CSG_PLC_PSL_Msk                (0x400UL)                 /*!< HRPWM0_CSG PLC: PSL (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG_PLC_PLSW_Pos               (11UL)                    /*!< HRPWM0_CSG PLC: PLSW (Bit 11)                               */
#define HRPWM0_CSG_PLC_PLSW_Msk               (0x800UL)                 /*!< HRPWM0_CSG PLC: PLSW (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSG_PLC_PLEC_Pos               (12UL)                    /*!< HRPWM0_CSG PLC: PLEC (Bit 12)                               */
#define HRPWM0_CSG_PLC_PLEC_Msk               (0x3000UL)                /*!< HRPWM0_CSG PLC: PLEC (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG_PLC_PLXC_Pos               (14UL)                    /*!< HRPWM0_CSG PLC: PLXC (Bit 14)                               */
#define HRPWM0_CSG_PLC_PLXC_Msk               (0xc000UL)                /*!< HRPWM0_CSG PLC: PLXC (Bitfield-Mask: 0x03)                  */

/* -------------------------------  HRPWM0_CSG_BLV  ------------------------------- */
#define HRPWM0_CSG_BLV_BLV_Pos                (0UL)                     /*!< HRPWM0_CSG BLV: BLV (Bit 0)                                 */
#define HRPWM0_CSG_BLV_BLV_Msk                (0xffUL)                  /*!< HRPWM0_CSG BLV: BLV (Bitfield-Mask: 0xff)                   */

/* -------------------------------  HRPWM0_CSG_SRE  ------------------------------- */
#define HRPWM0_CSG_SRE_VLS1E_Pos              (0UL)                     /*!< HRPWM0_CSG SRE: VLS1E (Bit 0)                               */
#define HRPWM0_CSG_SRE_VLS1E_Msk              (0x1UL)                   /*!< HRPWM0_CSG SRE: VLS1E (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG_SRE_VLS2E_Pos              (1UL)                     /*!< HRPWM0_CSG SRE: VLS2E (Bit 1)                               */
#define HRPWM0_CSG_SRE_VLS2E_Msk              (0x2UL)                   /*!< HRPWM0_CSG SRE: VLS2E (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG_SRE_TRGSE_Pos              (2UL)                     /*!< HRPWM0_CSG SRE: TRGSE (Bit 2)                               */
#define HRPWM0_CSG_SRE_TRGSE_Msk              (0x4UL)                   /*!< HRPWM0_CSG SRE: TRGSE (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG_SRE_STRSE_Pos              (3UL)                     /*!< HRPWM0_CSG SRE: STRSE (Bit 3)                               */
#define HRPWM0_CSG_SRE_STRSE_Msk              (0x8UL)                   /*!< HRPWM0_CSG SRE: STRSE (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG_SRE_STPSE_Pos              (4UL)                     /*!< HRPWM0_CSG SRE: STPSE (Bit 4)                               */
#define HRPWM0_CSG_SRE_STPSE_Msk              (0x10UL)                  /*!< HRPWM0_CSG SRE: STPSE (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG_SRE_STDE_Pos               (5UL)                     /*!< HRPWM0_CSG SRE: STDE (Bit 5)                                */
#define HRPWM0_CSG_SRE_STDE_Msk               (0x20UL)                  /*!< HRPWM0_CSG SRE: STDE (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSG_SRE_CRSE_Pos               (6UL)                     /*!< HRPWM0_CSG SRE: CRSE (Bit 6)                                */
#define HRPWM0_CSG_SRE_CRSE_Msk               (0x40UL)                  /*!< HRPWM0_CSG SRE: CRSE (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSG_SRE_CFSE_Pos               (7UL)                     /*!< HRPWM0_CSG SRE: CFSE (Bit 7)                                */
#define HRPWM0_CSG_SRE_CFSE_Msk               (0x80UL)                  /*!< HRPWM0_CSG SRE: CFSE (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSG_SRE_CSEE_Pos               (8UL)                     /*!< HRPWM0_CSG SRE: CSEE (Bit 8)                                */
#define HRPWM0_CSG_SRE_CSEE_Msk               (0x100UL)                 /*!< HRPWM0_CSG SRE: CSEE (Bitfield-Mask: 0x01)                  */

