alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC4100_series/Include/XMC4100.h
/* -------------------------------  HRPWM0_CSG0_BLV  ------------------------------ */
#define HRPWM0_CSG0_BLV_BLV_Pos               (0UL)                     /*!< HRPWM0_CSG0 BLV: BLV (Bit 0)                                */
#define HRPWM0_CSG0_BLV_BLV_Msk               (0xffUL)                  /*!< HRPWM0_CSG0 BLV: BLV (Bitfield-Mask: 0xff)                  */

/* -------------------------------  HRPWM0_CSG0_SRE  ------------------------------ */
#define HRPWM0_CSG0_SRE_VLS1E_Pos             (0UL)                     /*!< HRPWM0_CSG0 SRE: VLS1E (Bit 0)                              */
#define HRPWM0_CSG0_SRE_VLS1E_Msk             (0x1UL)                   /*!< HRPWM0_CSG0 SRE: VLS1E (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG0_SRE_VLS2E_Pos             (1UL)                     /*!< HRPWM0_CSG0 SRE: VLS2E (Bit 1)                              */
#define HRPWM0_CSG0_SRE_VLS2E_Msk             (0x2UL)                   /*!< HRPWM0_CSG0 SRE: VLS2E (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG0_SRE_TRGSE_Pos             (2UL)                     /*!< HRPWM0_CSG0 SRE: TRGSE (Bit 2)                              */
#define HRPWM0_CSG0_SRE_TRGSE_Msk             (0x4UL)                   /*!< HRPWM0_CSG0 SRE: TRGSE (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG0_SRE_STRSE_Pos             (3UL)                     /*!< HRPWM0_CSG0 SRE: STRSE (Bit 3)                              */
#define HRPWM0_CSG0_SRE_STRSE_Msk             (0x8UL)                   /*!< HRPWM0_CSG0 SRE: STRSE (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG0_SRE_STPSE_Pos             (4UL)                     /*!< HRPWM0_CSG0 SRE: STPSE (Bit 4)                              */
#define HRPWM0_CSG0_SRE_STPSE_Msk             (0x10UL)                  /*!< HRPWM0_CSG0 SRE: STPSE (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG0_SRE_STDE_Pos              (5UL)                     /*!< HRPWM0_CSG0 SRE: STDE (Bit 5)                               */
#define HRPWM0_CSG0_SRE_STDE_Msk              (0x20UL)                  /*!< HRPWM0_CSG0 SRE: STDE (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG0_SRE_CRSE_Pos              (6UL)                     /*!< HRPWM0_CSG0 SRE: CRSE (Bit 6)                               */
#define HRPWM0_CSG0_SRE_CRSE_Msk              (0x40UL)                  /*!< HRPWM0_CSG0 SRE: CRSE (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG0_SRE_CFSE_Pos              (7UL)                     /*!< HRPWM0_CSG0 SRE: CFSE (Bit 7)                               */
#define HRPWM0_CSG0_SRE_CFSE_Msk              (0x80UL)                  /*!< HRPWM0_CSG0 SRE: CFSE (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG0_SRE_CSEE_Pos              (8UL)                     /*!< HRPWM0_CSG0 SRE: CSEE (Bit 8)                               */
#define HRPWM0_CSG0_SRE_CSEE_Msk              (0x100UL)                 /*!< HRPWM0_CSG0 SRE: CSEE (Bitfield-Mask: 0x01)                 */

/* -------------------------------  HRPWM0_CSG0_SRS  ------------------------------ */
#define HRPWM0_CSG0_SRS_VLS1S_Pos             (0UL)                     /*!< HRPWM0_CSG0 SRS: VLS1S (Bit 0)                              */
#define HRPWM0_CSG0_SRS_VLS1S_Msk             (0x3UL)                   /*!< HRPWM0_CSG0 SRS: VLS1S (Bitfield-Mask: 0x03)                */
#define HRPWM0_CSG0_SRS_VLS2S_Pos             (2UL)                     /*!< HRPWM0_CSG0 SRS: VLS2S (Bit 2)                              */
#define HRPWM0_CSG0_SRS_VLS2S_Msk             (0xcUL)                   /*!< HRPWM0_CSG0 SRS: VLS2S (Bitfield-Mask: 0x03)                */
#define HRPWM0_CSG0_SRS_TRLS_Pos              (4UL)                     /*!< HRPWM0_CSG0 SRS: TRLS (Bit 4)                               */
#define HRPWM0_CSG0_SRS_TRLS_Msk              (0x30UL)                  /*!< HRPWM0_CSG0 SRS: TRLS (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG0_SRS_SSLS_Pos              (6UL)                     /*!< HRPWM0_CSG0 SRS: SSLS (Bit 6)                               */
#define HRPWM0_CSG0_SRS_SSLS_Msk              (0xc0UL)                  /*!< HRPWM0_CSG0 SRS: SSLS (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG0_SRS_STLS_Pos              (8UL)                     /*!< HRPWM0_CSG0 SRS: STLS (Bit 8)                               */
#define HRPWM0_CSG0_SRS_STLS_Msk              (0x300UL)                 /*!< HRPWM0_CSG0 SRS: STLS (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG0_SRS_CRFLS_Pos             (10UL)                    /*!< HRPWM0_CSG0 SRS: CRFLS (Bit 10)                             */
#define HRPWM0_CSG0_SRS_CRFLS_Msk             (0xc00UL)                 /*!< HRPWM0_CSG0 SRS: CRFLS (Bitfield-Mask: 0x03)                */
#define HRPWM0_CSG0_SRS_CSLS_Pos              (12UL)                    /*!< HRPWM0_CSG0 SRS: CSLS (Bit 12)                              */
#define HRPWM0_CSG0_SRS_CSLS_Msk              (0x3000UL)                /*!< HRPWM0_CSG0 SRS: CSLS (Bitfield-Mask: 0x03)                 */

/* -------------------------------  HRPWM0_CSG0_SWS  ------------------------------ */
#define HRPWM0_CSG0_SWS_SVLS1_Pos             (0UL)                     /*!< HRPWM0_CSG0 SWS: SVLS1 (Bit 0)                              */
#define HRPWM0_CSG0_SWS_SVLS1_Msk             (0x1UL)                   /*!< HRPWM0_CSG0 SWS: SVLS1 (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG0_SWS_SVLS2_Pos             (1UL)                     /*!< HRPWM0_CSG0 SWS: SVLS2 (Bit 1)                              */
#define HRPWM0_CSG0_SWS_SVLS2_Msk             (0x2UL)                   /*!< HRPWM0_CSG0 SWS: SVLS2 (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG0_SWS_STRGS_Pos             (2UL)                     /*!< HRPWM0_CSG0 SWS: STRGS (Bit 2)                              */
#define HRPWM0_CSG0_SWS_STRGS_Msk             (0x4UL)                   /*!< HRPWM0_CSG0 SWS: STRGS (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG0_SWS_SSTRS_Pos             (3UL)                     /*!< HRPWM0_CSG0 SWS: SSTRS (Bit 3)                              */
#define HRPWM0_CSG0_SWS_SSTRS_Msk             (0x8UL)                   /*!< HRPWM0_CSG0 SWS: SSTRS (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG0_SWS_SSTPS_Pos             (4UL)                     /*!< HRPWM0_CSG0 SWS: SSTPS (Bit 4)                              */
#define HRPWM0_CSG0_SWS_SSTPS_Msk             (0x10UL)                  /*!< HRPWM0_CSG0 SWS: SSTPS (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG0_SWS_SSTD_Pos              (5UL)                     /*!< HRPWM0_CSG0 SWS: SSTD (Bit 5)                               */
#define HRPWM0_CSG0_SWS_SSTD_Msk              (0x20UL)                  /*!< HRPWM0_CSG0 SWS: SSTD (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG0_SWS_SCRS_Pos              (6UL)                     /*!< HRPWM0_CSG0 SWS: SCRS (Bit 6)                               */
#define HRPWM0_CSG0_SWS_SCRS_Msk              (0x40UL)                  /*!< HRPWM0_CSG0 SWS: SCRS (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG0_SWS_SCFS_Pos              (7UL)                     /*!< HRPWM0_CSG0 SWS: SCFS (Bit 7)                               */
#define HRPWM0_CSG0_SWS_SCFS_Msk              (0x80UL)                  /*!< HRPWM0_CSG0 SWS: SCFS (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG0_SWS_SCSS_Pos              (8UL)                     /*!< HRPWM0_CSG0 SWS: SCSS (Bit 8)                               */
#define HRPWM0_CSG0_SWS_SCSS_Msk              (0x100UL)                 /*!< HRPWM0_CSG0 SWS: SCSS (Bitfield-Mask: 0x01)                 */

/* -------------------------------  HRPWM0_CSG0_SWC  ------------------------------ */
#define HRPWM0_CSG0_SWC_CVLS1_Pos             (0UL)                     /*!< HRPWM0_CSG0 SWC: CVLS1 (Bit 0)                              */
#define HRPWM0_CSG0_SWC_CVLS1_Msk             (0x1UL)                   /*!< HRPWM0_CSG0 SWC: CVLS1 (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG0_SWC_CVLS2_Pos             (1UL)                     /*!< HRPWM0_CSG0 SWC: CVLS2 (Bit 1)                              */
#define HRPWM0_CSG0_SWC_CVLS2_Msk             (0x2UL)                   /*!< HRPWM0_CSG0 SWC: CVLS2 (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG0_SWC_CTRGS_Pos             (2UL)                     /*!< HRPWM0_CSG0 SWC: CTRGS (Bit 2)                              */
#define HRPWM0_CSG0_SWC_CTRGS_Msk             (0x4UL)                   /*!< HRPWM0_CSG0 SWC: CTRGS (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG0_SWC_CSTRS_Pos             (3UL)                     /*!< HRPWM0_CSG0 SWC: CSTRS (Bit 3)                              */
#define HRPWM0_CSG0_SWC_CSTRS_Msk             (0x8UL)                   /*!< HRPWM0_CSG0 SWC: CSTRS (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG0_SWC_CSTPS_Pos             (4UL)                     /*!< HRPWM0_CSG0 SWC: CSTPS (Bit 4)                              */
#define HRPWM0_CSG0_SWC_CSTPS_Msk             (0x10UL)                  /*!< HRPWM0_CSG0 SWC: CSTPS (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG0_SWC_CSTD_Pos              (5UL)                     /*!< HRPWM0_CSG0 SWC: CSTD (Bit 5)                               */
#define HRPWM0_CSG0_SWC_CSTD_Msk              (0x20UL)                  /*!< HRPWM0_CSG0 SWC: CSTD (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG0_SWC_CCRS_Pos              (6UL)                     /*!< HRPWM0_CSG0 SWC: CCRS (Bit 6)                               */
#define HRPWM0_CSG0_SWC_CCRS_Msk              (0x40UL)                  /*!< HRPWM0_CSG0 SWC: CCRS (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG0_SWC_CCFS_Pos              (7UL)                     /*!< HRPWM0_CSG0 SWC: CCFS (Bit 7)                               */
#define HRPWM0_CSG0_SWC_CCFS_Msk              (0x80UL)                  /*!< HRPWM0_CSG0 SWC: CCFS (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG0_SWC_CCSS_Pos              (8UL)                     /*!< HRPWM0_CSG0 SWC: CCSS (Bit 8)                               */
#define HRPWM0_CSG0_SWC_CCSS_Msk              (0x100UL)                 /*!< HRPWM0_CSG0 SWC: CCSS (Bitfield-Mask: 0x01)                 */

/* ------------------------------  HRPWM0_CSG0_ISTAT  ----------------------------- */
#define HRPWM0_CSG0_ISTAT_VLS1S_Pos           (0UL)                     /*!< HRPWM0_CSG0 ISTAT: VLS1S (Bit 0)                            */
#define HRPWM0_CSG0_ISTAT_VLS1S_Msk           (0x1UL)                   /*!< HRPWM0_CSG0 ISTAT: VLS1S (Bitfield-Mask: 0x01)              */
#define HRPWM0_CSG0_ISTAT_VLS2S_Pos           (1UL)                     /*!< HRPWM0_CSG0 ISTAT: VLS2S (Bit 1)                            */
#define HRPWM0_CSG0_ISTAT_VLS2S_Msk           (0x2UL)                   /*!< HRPWM0_CSG0 ISTAT: VLS2S (Bitfield-Mask: 0x01)              */
#define HRPWM0_CSG0_ISTAT_TRGSS_Pos           (2UL)                     /*!< HRPWM0_CSG0 ISTAT: TRGSS (Bit 2)                            */
#define HRPWM0_CSG0_ISTAT_TRGSS_Msk           (0x4UL)                   /*!< HRPWM0_CSG0 ISTAT: TRGSS (Bitfield-Mask: 0x01)              */
#define HRPWM0_CSG0_ISTAT_STRSS_Pos           (3UL)                     /*!< HRPWM0_CSG0 ISTAT: STRSS (Bit 3)                            */
#define HRPWM0_CSG0_ISTAT_STRSS_Msk           (0x8UL)                   /*!< HRPWM0_CSG0 ISTAT: STRSS (Bitfield-Mask: 0x01)              */
#define HRPWM0_CSG0_ISTAT_STPSS_Pos           (4UL)                     /*!< HRPWM0_CSG0 ISTAT: STPSS (Bit 4)                            */
#define HRPWM0_CSG0_ISTAT_STPSS_Msk           (0x10UL)                  /*!< HRPWM0_CSG0 ISTAT: STPSS (Bitfield-Mask: 0x01)              */
#define HRPWM0_CSG0_ISTAT_STDS_Pos            (5UL)                     /*!< HRPWM0_CSG0 ISTAT: STDS (Bit 5)                             */
#define HRPWM0_CSG0_ISTAT_STDS_Msk            (0x20UL)                  /*!< HRPWM0_CSG0 ISTAT: STDS (Bitfield-Mask: 0x01)               */
#define HRPWM0_CSG0_ISTAT_CRSS_Pos            (6UL)                     /*!< HRPWM0_CSG0 ISTAT: CRSS (Bit 6)                             */
#define HRPWM0_CSG0_ISTAT_CRSS_Msk            (0x40UL)                  /*!< HRPWM0_CSG0 ISTAT: CRSS (Bitfield-Mask: 0x01)               */
#define HRPWM0_CSG0_ISTAT_CFSS_Pos            (7UL)                     /*!< HRPWM0_CSG0 ISTAT: CFSS (Bit 7)                             */
#define HRPWM0_CSG0_ISTAT_CFSS_Msk            (0x80UL)                  /*!< HRPWM0_CSG0 ISTAT: CFSS (Bitfield-Mask: 0x01)               */
#define HRPWM0_CSG0_ISTAT_CSES_Pos            (8UL)                     /*!< HRPWM0_CSG0 ISTAT: CSES (Bit 8)                             */
#define HRPWM0_CSG0_ISTAT_CSES_Msk            (0x100UL)                 /*!< HRPWM0_CSG0 ISTAT: CSES (Bitfield-Mask: 0x01)               */


/* ================================================================================ */
/* ================      struct 'HRPWM0_CSG1' Position & Mask      ================ */
/* ================================================================================ */


/* -------------------------------  HRPWM0_CSG1_DCI  ------------------------------ */
#define HRPWM0_CSG1_DCI_SVIS_Pos              (0UL)                     /*!< HRPWM0_CSG1 DCI: SVIS (Bit 0)                               */
#define HRPWM0_CSG1_DCI_SVIS_Msk              (0xfUL)                   /*!< HRPWM0_CSG1 DCI: SVIS (Bitfield-Mask: 0x0f)                 */
#define HRPWM0_CSG1_DCI_STRIS_Pos             (4UL)                     /*!< HRPWM0_CSG1 DCI: STRIS (Bit 4)                              */
#define HRPWM0_CSG1_DCI_STRIS_Msk             (0xf0UL)                  /*!< HRPWM0_CSG1 DCI: STRIS (Bitfield-Mask: 0x0f)                */
#define HRPWM0_CSG1_DCI_STPIS_Pos             (8UL)                     /*!< HRPWM0_CSG1 DCI: STPIS (Bit 8)                              */
#define HRPWM0_CSG1_DCI_STPIS_Msk             (0xf00UL)                 /*!< HRPWM0_CSG1 DCI: STPIS (Bitfield-Mask: 0x0f)                */
#define HRPWM0_CSG1_DCI_TRGIS_Pos             (12UL)                    /*!< HRPWM0_CSG1 DCI: TRGIS (Bit 12)                             */
#define HRPWM0_CSG1_DCI_TRGIS_Msk             (0xf000UL)                /*!< HRPWM0_CSG1 DCI: TRGIS (Bitfield-Mask: 0x0f)                */
#define HRPWM0_CSG1_DCI_STIS_Pos              (16UL)                    /*!< HRPWM0_CSG1 DCI: STIS (Bit 16)                              */
#define HRPWM0_CSG1_DCI_STIS_Msk              (0xf0000UL)               /*!< HRPWM0_CSG1 DCI: STIS (Bitfield-Mask: 0x0f)                 */
#define HRPWM0_CSG1_DCI_SCS_Pos               (20UL)                    /*!< HRPWM0_CSG1 DCI: SCS (Bit 20)                               */
#define HRPWM0_CSG1_DCI_SCS_Msk               (0x300000UL)              /*!< HRPWM0_CSG1 DCI: SCS (Bitfield-Mask: 0x03)                  */

/* -------------------------------  HRPWM0_CSG1_IES  ------------------------------ */
#define HRPWM0_CSG1_IES_SVLS_Pos              (0UL)                     /*!< HRPWM0_CSG1 IES: SVLS (Bit 0)                               */
#define HRPWM0_CSG1_IES_SVLS_Msk              (0x3UL)                   /*!< HRPWM0_CSG1 IES: SVLS (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG1_IES_STRES_Pos             (2UL)                     /*!< HRPWM0_CSG1 IES: STRES (Bit 2)                              */
#define HRPWM0_CSG1_IES_STRES_Msk             (0xcUL)                   /*!< HRPWM0_CSG1 IES: STRES (Bitfield-Mask: 0x03)                */
#define HRPWM0_CSG1_IES_STPES_Pos             (4UL)                     /*!< HRPWM0_CSG1 IES: STPES (Bit 4)                              */
#define HRPWM0_CSG1_IES_STPES_Msk             (0x30UL)                  /*!< HRPWM0_CSG1 IES: STPES (Bitfield-Mask: 0x03)                */
#define HRPWM0_CSG1_IES_TRGES_Pos             (6UL)                     /*!< HRPWM0_CSG1 IES: TRGES (Bit 6)                              */
#define HRPWM0_CSG1_IES_TRGES_Msk             (0xc0UL)                  /*!< HRPWM0_CSG1 IES: TRGES (Bitfield-Mask: 0x03)                */
#define HRPWM0_CSG1_IES_STES_Pos              (8UL)                     /*!< HRPWM0_CSG1 IES: STES (Bit 8)                               */
#define HRPWM0_CSG1_IES_STES_Msk              (0x300UL)                 /*!< HRPWM0_CSG1 IES: STES (Bitfield-Mask: 0x03)                 */

/* -------------------------------  HRPWM0_CSG1_SC  ------------------------------- */
#define HRPWM0_CSG1_SC_PSRM_Pos               (0UL)                     /*!< HRPWM0_CSG1 SC: PSRM (Bit 0)                                */
#define HRPWM0_CSG1_SC_PSRM_Msk               (0x3UL)                   /*!< HRPWM0_CSG1 SC: PSRM (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG1_SC_PSTM_Pos               (2UL)                     /*!< HRPWM0_CSG1 SC: PSTM (Bit 2)                                */
#define HRPWM0_CSG1_SC_PSTM_Msk               (0xcUL)                   /*!< HRPWM0_CSG1 SC: PSTM (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG1_SC_FPD_Pos                (4UL)                     /*!< HRPWM0_CSG1 SC: FPD (Bit 4)                                 */
#define HRPWM0_CSG1_SC_FPD_Msk                (0x10UL)                  /*!< HRPWM0_CSG1 SC: FPD (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG1_SC_PSV_Pos                (5UL)                     /*!< HRPWM0_CSG1 SC: PSV (Bit 5)                                 */
#define HRPWM0_CSG1_SC_PSV_Msk                (0x60UL)                  /*!< HRPWM0_CSG1 SC: PSV (Bitfield-Mask: 0x03)                   */
#define HRPWM0_CSG1_SC_SCM_Pos                (8UL)                     /*!< HRPWM0_CSG1 SC: SCM (Bit 8)                                 */
#define HRPWM0_CSG1_SC_SCM_Msk                (0x300UL)                 /*!< HRPWM0_CSG1 SC: SCM (Bitfield-Mask: 0x03)                   */
#define HRPWM0_CSG1_SC_SSRM_Pos               (10UL)                    /*!< HRPWM0_CSG1 SC: SSRM (Bit 10)                               */
#define HRPWM0_CSG1_SC_SSRM_Msk               (0xc00UL)                 /*!< HRPWM0_CSG1 SC: SSRM (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG1_SC_SSTM_Pos               (12UL)                    /*!< HRPWM0_CSG1 SC: SSTM (Bit 12)                               */
#define HRPWM0_CSG1_SC_SSTM_Msk               (0x3000UL)                /*!< HRPWM0_CSG1 SC: SSTM (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG1_SC_SVSC_Pos               (14UL)                    /*!< HRPWM0_CSG1 SC: SVSC (Bit 14)                               */
#define HRPWM0_CSG1_SC_SVSC_Msk               (0xc000UL)                /*!< HRPWM0_CSG1 SC: SVSC (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG1_SC_SWSM_Pos               (16UL)                    /*!< HRPWM0_CSG1 SC: SWSM (Bit 16)                               */
#define HRPWM0_CSG1_SC_SWSM_Msk               (0x30000UL)               /*!< HRPWM0_CSG1 SC: SWSM (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG1_SC_GCFG_Pos               (18UL)                    /*!< HRPWM0_CSG1 SC: GCFG (Bit 18)                               */
#define HRPWM0_CSG1_SC_GCFG_Msk               (0xc0000UL)               /*!< HRPWM0_CSG1 SC: GCFG (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG1_SC_IST_Pos                (20UL)                    /*!< HRPWM0_CSG1 SC: IST (Bit 20)                                */
#define HRPWM0_CSG1_SC_IST_Msk                (0x100000UL)              /*!< HRPWM0_CSG1 SC: IST (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG1_SC_PSE_Pos                (21UL)                    /*!< HRPWM0_CSG1 SC: PSE (Bit 21)                                */
#define HRPWM0_CSG1_SC_PSE_Msk                (0x200000UL)              /*!< HRPWM0_CSG1 SC: PSE (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG1_SC_PSWM_Pos               (24UL)                    /*!< HRPWM0_CSG1 SC: PSWM (Bit 24)                               */
#define HRPWM0_CSG1_SC_PSWM_Msk               (0x3000000UL)             /*!< HRPWM0_CSG1 SC: PSWM (Bitfield-Mask: 0x03)                  */

/* -------------------------------  HRPWM0_CSG1_PC  ------------------------------- */
#define HRPWM0_CSG1_PC_PSWV_Pos               (0UL)                     /*!< HRPWM0_CSG1 PC: PSWV (Bit 0)                                */
#define HRPWM0_CSG1_PC_PSWV_Msk               (0x3fUL)                  /*!< HRPWM0_CSG1 PC: PSWV (Bitfield-Mask: 0x3f)                  */

/* ------------------------------  HRPWM0_CSG1_DSV1  ------------------------------ */
#define HRPWM0_CSG1_DSV1_DSV1_Pos             (0UL)                     /*!< HRPWM0_CSG1 DSV1: DSV1 (Bit 0)                              */
#define HRPWM0_CSG1_DSV1_DSV1_Msk             (0x3ffUL)                 /*!< HRPWM0_CSG1 DSV1: DSV1 (Bitfield-Mask: 0x3ff)               */

/* ------------------------------  HRPWM0_CSG1_DSV2  ------------------------------ */
#define HRPWM0_CSG1_DSV2_DSV2_Pos             (0UL)                     /*!< HRPWM0_CSG1 DSV2: DSV2 (Bit 0)                              */
#define HRPWM0_CSG1_DSV2_DSV2_Msk             (0x3ffUL)                 /*!< HRPWM0_CSG1 DSV2: DSV2 (Bitfield-Mask: 0x3ff)               */

/* ------------------------------  HRPWM0_CSG1_SDSV1  ----------------------------- */
#define HRPWM0_CSG1_SDSV1_SDSV1_Pos           (0UL)                     /*!< HRPWM0_CSG1 SDSV1: SDSV1 (Bit 0)                            */
#define HRPWM0_CSG1_SDSV1_SDSV1_Msk           (0x3ffUL)                 /*!< HRPWM0_CSG1 SDSV1: SDSV1 (Bitfield-Mask: 0x3ff)             */

/* -------------------------------  HRPWM0_CSG1_SPC  ------------------------------ */
#define HRPWM0_CSG1_SPC_SPSWV_Pos             (0UL)                     /*!< HRPWM0_CSG1 SPC: SPSWV (Bit 0)                              */
#define HRPWM0_CSG1_SPC_SPSWV_Msk             (0x3fUL)                  /*!< HRPWM0_CSG1 SPC: SPSWV (Bitfield-Mask: 0x3f)                */

